driver-tests/bpelse/assign/VariablePropertyTest/conditionProjJBI/test/results/ConditionOnElementBasedPropertyTest/Actual_20130222130113_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <msgElem xmlns="http://j2ee.netbeans.org/schema/conditionsSchema" xmlns:msgns="http://j2ee.netbeans.org/wsdl/conditions">
      <intElem xmlns="">404</intElem>
      <strElem xmlns="">Test: If True: </strElem>
      <boolElem xmlns="">true</boolElem>
    </msgElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>