driver-tests/bpelse/assign/VariablePropertyTest/conditionProjJBI/test/ConditionOnTypeBasedPropertyTest/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:msgElem xmlns:msgns="http://j2ee.netbeans.org/wsdl/conditions" xmlns:ns1="http://j2ee.netbeans.org/schema/conditionsSchema">
      <intElem xmlns="">303</intElem>
      <strElem xmlns="">Test: If True: </strElem>
      <boolElem xmlns="">true</boolElem>
    </ns1:msgElem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
