driver-tests/bpelse/assign/VariablePropertyTest/conditionProjJBI/test/ConditionOnElementBasedPropertyTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://j2ee.netbeans.org/schema/conditionsSchema">
  <soapenv:Body>
    <con:msgElem>
      <intElem>404</intElem>
      <strElem>Test:</strElem>
      <boolElem>true</boolElem>
    </con:msgElem>
  </soapenv:Body>
</soapenv:Envelope>